# Handling Missing Data with Pandas

In [2]:
# Lbries
import numpy as np
import pandas as pd

## Pandas utility functions
Similary with `Numpy`, pandas aslo has a few utility funstions to indentify and detect null values:

In [9]:
pd.isnull(np.nan)

True

In [11]:
pd.isnull(None)

True

In [13]:
pd.isna(np.nan)

True

In [15]:
pd.isna(None)

True

The opposite exists:

In [18]:
pd.notnull(None)

False

In [20]:
pd.notnull(np.nan)

False

In [22]:
pd.notnull(3)

True

This functions also work with Series and `DataFrame`:

In [27]:
pd.isnull(pd.Series([1, np.nan, 7]))

0    False
1     True
2    False
dtype: bool

In [29]:
pd.notnull(pd.Series([1, np.nan, 7]))

0     True
1    False
2     True
dtype: bool

In [37]:
pd.isnull(pd.DataFrame({
    'A': [1, np.nan, 7],
    'B': [np.nan, 2, 3],
    'C': [np.nan, 2, np.nan]
}))

       A      B      C
0  False   True   True
1   True  False  False
2  False  False   True

## Pandas Operations with Missing Values
Pandas manages missing values more gracefully than numpy. `nan` will no longer behave as "viruses", and operations will just ignore them completly:

In [41]:
pd.Series([1, 2, np.nan]).count()

2

In [43]:
pd.Series([1, 2, np.nan]).sum()

3.0

In [45]:
pd.Series([1, 2, np.nan]).mean()

1.5

## Filtering missing data
As we saw with numpy, we could combine boolean selection + `pd.isnull` to filter out those `nan` and null values:

In [48]:
s = pd.Series([1, 2, 3, np.nan, np.nan, 4])

In [50]:
pd.notnull(s)

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [52]:
pd.notnull(s).count()

6

In [54]:
s[pd.notnull(s)]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

But both `notnull` and Ã¬snull` are also methods od `Series` and `DataFrame`so we could use it that way:

In [57]:
s.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [59]:
s.notnull()

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [61]:
s[s.notnull()]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

## Dropping null values
Boolean selection + `notnull()` seems a little bit verbose and repetitive. And as we said before: any repetitive task will porbably have a better, more DRY way. In this case, we can use the `dropna` method:

In [65]:
s.dropna()

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

## Dropping null values on DataFrames

In [68]:
df = pd.DataFrame({
    'A': [1, np.nan, 30, np.nan],
    'B': [2, 8, 31, np.nan],
    'C': [np.nan, 9, 32, 100],
    'D': [5, 8, 34, 110],
})

In [70]:
df

      A     B      C    D
0   1.0   2.0    NaN    5
1   NaN   8.0    9.0    8
2  30.0  31.0   32.0   34
3   NaN   NaN  100.0  110

In [72]:
df.isnull()

       A      B      C      D
0  False  False   True  False
1   True  False  False  False
2  False  False  False  False
3   True   True  False  False

In [76]:
df.isnull().sum()

A    2
B    1
C    1
D    0
dtype: int64

In [78]:
df.dropna()

      A     B     C   D
2  30.0  31.0  32.0  34

In [80]:
df.dropna(axis=1)

     D
0    5
1    8
2   34
3  110

In [82]:
df2 = pd.DataFrame({
    'A': [1, np.nan, 30],
    'B': [2, np.nan, 31],
    'C': [np.nan, np.nan, 100]
,})

In [84]:
df2

      A     B      C
0   1.0   2.0    NaN
1   NaN   NaN    NaN
2  30.0  31.0  100.0

In [88]:
df2.dropna(how='all')

      A     B      C
0   1.0   2.0    NaN
2  30.0  31.0  100.0

In [92]:
df.dropna(how='any') # default behavior

      A     B     C   D
2  30.0  31.0  32.0  34

In [94]:
df

      A     B      C    D
0   1.0   2.0    NaN    5
1   NaN   8.0    9.0    8
2  30.0  31.0   32.0   34
3   NaN   NaN  100.0  110

In [100]:
df.dropna(thresh=3)

      A     B     C   D
0   1.0   2.0   NaN   5
1   NaN   8.0   9.0   8
2  30.0  31.0  32.0  34

In [102]:
df.dropna(thresh=3, axis='columns')

      B      C    D
0   2.0    NaN    5
1   8.0    9.0    8
2  31.0   32.0   34
3   NaN  100.0  110

## Filling null values

In [105]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

### Filling nulls with a arbitrary value

In [108]:
s.fillna(0)

0    1.0
1    2.0
2    3.0
3    0.0
4    0.0
5    4.0
dtype: float64

In [110]:
s.fillna(s.mean())

0    1.0
1    2.0
2    3.0
3    2.5
4    2.5
5    4.0
dtype: float64

In [112]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

### Filling nulls with contiguous (close) values

In [115]:
s.fillna(method='ffill')

C:\Users\valen\AppData\Local\Temp\ipykernel_8656\1029756637.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  s.fillna(method='ffill')

0    1.0
1    2.0
2    3.0
3    3.0
4    3.0
5    4.0
dtype: float64

In [117]:
s.fillna(method='bfill')

C:\Users\valen\AppData\Local\Temp\ipykernel_8656\1641295691.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  s.fillna(method='bfill')

0    1.0
1    2.0
2    3.0
3    4.0
4    4.0
5    4.0
dtype: float64

In [119]:
pd.Series([np.nan, 3, np.nan, 9]).fillna(method='ffill')

C:\Users\valen\AppData\Local\Temp\ipykernel_8656\533636215.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  pd.Series([np.nan, 3, np.nan, 9]).fillna(method='ffill')

0    NaN
1    3.0
2    3.0
3    9.0
dtype: float64

In [121]:
pd.Series([np.nan, 3, np.nan, np.nan]).fillna(method='bfill')

C:\Users\valen\AppData\Local\Temp\ipykernel_8656\498660921.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  pd.Series([np.nan, 3, np.nan, np.nan]).fillna(method='bfill')

0    3.0
1    3.0
2    NaN
3    NaN
dtype: float64

## Filling null vamues on DataFrame

In [140]:
df

      A     B      C    D
0   1.0   2.0    NaN    5
1   NaN   8.0    9.0    8
2  30.0  31.0   32.0   34
3   NaN   NaN  100.0  110

In [134]:
df.fillna({'A': 0, 'B': 99, 'C': df['C'].mean()})

      A     B      C    D
0   1.0   2.0   47.0    5
1   0.0   8.0    9.0    8
2  30.0  31.0   32.0   34
3   0.0  99.0  100.0  110

In [136]:
df.fillna(method='ffill', axis=0)

C:\Users\valen\AppData\Local\Temp\ipykernel_8656\3122255136.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', axis=0)

      A     B      C    D
0   1.0   2.0    NaN    5
1   1.0   8.0    9.0    8
2  30.0  31.0   32.0   34
3  30.0  31.0  100.0  110

In [145]:
df.fillna(method='ffill', axis=1)

C:\Users\valen\AppData\Local\Temp\ipykernel_8656\901808322.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', axis=1)

      A     B      C      D
0   1.0   2.0    2.0    5.0
1   NaN   8.0    9.0    8.0
2  30.0  31.0   32.0   34.0
3   NaN   NaN  100.0  110.0